Core/src/src/Documents/СчетФактураОтправленныйГрузия/СчетФактураОтправленныйГрузия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактураОтправленныйГрузия</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.АвансыОтправленныхФактур</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСФ</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Корректировочная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаКорректировки</name>
    <type>
      <types>EnumRef.ПричиныКорректировкиСФ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеКорректировки</name>
    <type>
      <types>DocumentRef.СчетФактураОтправленныйГрузия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.ЧекККМ</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.Взаимозачет</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыПлатежа</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПоступлениеВКассу</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ПоступлениеНаСчет</types>
        <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/Documents/СчетФактураОтправленныйГрузия/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСчетФактураОтправленныйГрузия, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураОтправленныйГрузияДокументыПлатежа.Ссылка,
		|	СчетФактураОтправленныйГрузияДокументыПлатежа.Ссылка.Организация,
		|	СчетФактураОтправленныйГрузияДокументыПлатежа.Ссылка.Контрагент,
		|	КОНЕЦПЕРИОДА(СчетФактураОтправленныйГрузияДокументыПлатежа.Ссылка.ДатаВходящегоДокумента, МЕСЯЦ) КАК Период,
		|	СчетФактураОтправленныйГрузияДокументыПлатежа.НомерСтроки КАК НомерСтроки,
		|	СчетФактураОтправленныйГрузияДокументыПлатежа.Документ,
		|	СчетФактураОтправленныйГрузияДокументыПлатежа.Договор,
		|	СчетФактураОтправленныйГрузияДокументыПлатежа.СуммаНДС КАК Сумма
		|ПОМЕСТИТЬ ДокументыПлатежа
		|ИЗ
		|	Документ.СчетФактураОтправленныйГрузия.ДокументыПлатежа КАК СчетФактураОтправленныйГрузияДокументыПлатежа
		|ГДЕ
		|	СчетФактураОтправленныйГрузияДокументыПлатежа.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", 		ДокументСчетФактураОтправленныйГрузия);
	Запрос.Выполнить();
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_СчетФактураОтправленныйГрузия(ДокументСчетФактураОтправленныйГрузия, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаАвансыОтправленныхФактур_СчетФактураОтправленныйГрузия(ДокументСчетФактураОтправленныйГрузия, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаРасчетыПоНалогам(ДокументСчетФактураОтправленныйГрузия, СтруктураДополнительныеСвойства); // Kuzmich, 16.09.2019, Добавление бух проводок в счет фактурах
КонецПроцедуры

// Kuzmich, 16.09.2019, Добавление бух проводок в счет фактурах
Процедура СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаСчетФактураОтправленныйГрузия, СтруктураДополнительныеСвойства)
	
	Если ЗначениеЗаполнено(ДокументСсылкаСчетФактураОтправленныйГрузия.ВидНалога) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка.Организация КАК Организация,
		|	СчетФактураОтправленныйГрузияДокументыОснования.ДокументОснование.ВидНалогаНДС КАК ВидНалога,
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка.СчетУчетаРегл КАК СчетУчета,
		|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалоговыеОбязательства) КАК СрокУплаты,
		|	&СодержаниеПроводки КАК СодержаниеПроводки,
		|	СчетФактураОтправленныйГрузияДокументыОснования.СуммаНДС КАК Сумма
		|ИЗ
		|	Документ.СчетФактураОтправленныйГрузия.ДокументыОснования КАК СчетФактураОтправленныйГрузияДокументыОснования
		|ГДЕ
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка.Организация,
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка.ВидНалога,
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка.СчетУчетаРегл,
		|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалоговыеОбязательства),
		|	&СодержаниеПроводки,
		|	СчетФактураОтправленныйГрузияДокументыОснования.СуммаНДС
		|ИЗ
		|	Документ.СчетФактураОтправленныйГрузия.ДокументыОснования КАК СчетФактураОтправленныйГрузияДокументыОснования
		|ГДЕ
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка",	ДокументСсылкаСчетФактураОтправленныйГрузия);
		Запрос.УстановитьПараметр("СодержаниеПроводки",	НСТР("ka='დღგ';ru='НДС';en='VAT'"));
		
		РезультатЗапроса = Запрос.Выполнить();
		врТаблицаРасчетыПоНалогам = РезультатЗапроса.Выгрузить();	
		врТаблицаРасчетыПоНалогам.Свернуть("Период,ВидДвижения,Организация,ВидНалога,СчетУчета,СрокУплаты,СодержаниеПроводки","Сумма");
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", врТаблицаРасчетыПоНалогам);
		
	КонецЕсли;
КонецПроцедуры
// Kuzmich, 16.09.2019, Добавление бух проводок в счет фактурах


Функция СформироватьПечатнуюФормуСчетФактураRS(ТекущийДокумент)
	
	ИспользоватьХарактеристики = Константы.ФункциональнаяОпцияИспользоватьХарактеристики.Получить();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураОтправленныйГрузия_ПФ_MXL_СчетФактураRS";

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СчетФактураОтправленныйГрузия.ПФ_MXL_СчетФактураRS");
	
	ОбластьШапка		        = Макет.ПолучитьОбласть("Шапка");
	ОбластьТабдичнаяЧасть	    = Макет.ПолучитьОбласть("ТабдичнаяЧасть");														
	ОбластьПодвалТабличнойЧасти = Макет.ПолучитьОбласть("ПодвалТабличнойЧасти");	
	ОбластьПодвалНакладная		= Макет.ПолучитьОбласть("ПодвалНакладная");
	ОбластьПодвалПодпись		= Макет.ПолучитьОбласть("ПодвалПодпись");	
	ТабличныйДокумент.Очистить();
	
	
	ОбластьШапка.Параметры.НомерВходящегоДокумента = ТекущийДокумент.НомерВходящегоДокумента;
	ОбластьШапка.Параметры.МесяцВходящегоДокумента = Формат(ТекущийДокумент.ДатаВходящегоДокумента,"ДФ=МMММ");	
	ОбластьШапка.Параметры.ГодВходящегоДокумента = Формат(ТекущийДокумент.ДатаВходящегоДокумента,"ДФ=yyyy");
	
	ОбластьШапка.Параметры.ЧислоДата = Формат(ТекущийДокумент.Дата,"ДФ=dd");
	ОбластьШапка.Параметры.МесяцДата =Формат(ТекущийДокумент.Дата,"ДФ=МMММ");
	ОбластьШапка.Параметры.ГодДата = Формат(ТекущийДокумент.Дата,"ДФ=yyyy");
		
	 ОбластьШапка.Параметры.Заполнить(ПолучитьРазделенныйИД(ТекущийДокумент.Организация.ИНН, "Организация"));
	 ОбластьШапка.Параметры.Заполнить(ПолучитьРазделенныйИД(ТекущийДокумент.Контрагент.ИНН, "Контрагент"));
	 ОбластьШапка.Параметры.Организация = ТекущийДокумент.Организация;
	 ОбластьШапка.Параметры.Контрагент = ТекущийДокумент.Контрагент;
	 ТабличныйДокумент.Вывести(ОбластьШапка);
	 
	 ИтогВсего = 0;
	 ИтогСуммаНДС = 0;
	 
	 
	 Для Каждого стр Из ТекущийДокумент.Запасы Цикл 
		 
		 
		 ОбластьТабдичнаяЧасть.Параметры.Заполнить(стр);
		 
		 ИтогВсего = ИтогВсего + стр.Всего;
		 ИтогСуммаНДС = ИтогСуммаНДС + стр.СуммаНДС;
		 
		 ТабличныйДокумент.Вывести(ОбластьТабдичнаяЧасть);
	 КонецЦикла;
	 
	 ОбластьПодвалТабличнойЧасти.Параметры.ИтогВсего =  ИтогВсего;
	 ОбластьПодвалТабличнойЧасти.Параметры.ИтогСуммаНДС =  ИтогСуммаНДС;
	 ТабличныйДокумент.Вывести(ОбластьПодвалТабличнойЧасти);
	 
	 
	 Для Каждого стр Из ТекущийДокумент.ДокументыОснования Цикл 
		 
		 Если ТипЗнч(стр.ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда 
			 
			 НайденныйЭлНакладная = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйЭлНакладная(стр.ДокументОснование); 
			 
		 КонецЕсли;
		 
	 КонецЦикла;
	 
	 Если ЗначениеЗаполнено(НайденныйЭлНакладная) Тогда 
		 
		 ОбластьПодвалНакладная.Параметры.НомерНакладная = НайденныйЭлНакладная.Ссылка.НомерТН;
		 ОбластьПодвалНакладная.Параметры.ДатаНакладная = НайденныйЭлНакладная.Дата;
		 ТабличныйДокумент.Вывести(ОбластьПодвалНакладная);
		 
	 КонецЕсли;
	 
	 
	  ТабличныйДокумент.Вывести(ОбластьПодвалПодпись);
	 //НайденныйЭлНакладная = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйЭлНакладная(стр.ДокументОснование);

	
	// Вставить обработку выборки ВыборкаДетальныеЗаписи
		//ОбластьШапка.Параметры.Заполнить();	
	//
	//Выборка = Запрос.Выполнить().Выгрузить();
	//Выборка.Следующий();
	//ОбластьШапка.Параметры.Заполнить(Выборка);
	//
	

	
	Возврат ТабличныйДокумент
	
КонецФункции

Функция  ПолучитьРазделенныйИД(ИД, ВладелецИД)
	
	
	Если ВладелецИД = "Организация" Тогда 
		
		 ИмяКлюча = "ИДОгр";
	ИначеЕсли ВладелецИД = "Контрагент" Тогда 
		
		ИмяКлюча = "ИДКонтр";
	КонецЕсли;
	
	
	струкЦифров = Новый Структура;
	
	Для инд = 1 По СтрДлина(ИД) Цикл 
		струкЦифров.Вставить(ИмяКлюча+Строка(инд),Сред(ИД, инд, 1));
	КонецЦикла;
	
	Возврат струкЦифров;	
КонецФункции

// Функция формирует печатную форму документа по указанному макету.
//
// Параметры:
//	ТабличныйДокумент - ТабличныйДокумент в который будет выводится печатная
//				   форма.
//  ИмяМакета    - Строка, имя макета печатной формы.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_СчетФактураОтправленныйГрузия";
	
	ПервыйДокумент = Истина;
	
	Если ИмяМакета = "СчетФактураRS" Тогда
		
	КонецЕсли;
	
	Для каждого ТекущийДокумент Из МассивОбъектов Цикл
	
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ИмяМакета = "СчетФактураRS" Тогда
					
			ТабличныйДокумент.Вывести(СформироватьПечатнуюФормуСчетФактураRS(ТекущийДокумент));
				
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактураRS") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетФактураRS", НСтр("en='Waybill RS';ka='ანგარიშ ფაქტურა ცხრილი';ru='Счет Фактура RS'"), ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "СчетФактураRS"));
		
	КонецЕсли;
	
	// параметры отправки печатных форм по электронной почте
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// СчетФактураRS
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетФактураRS";
	КомандаПечати.Представление = НСтр("en='Waybill RS';ka='ანგარიშ ფაქტურა ცხრილი';ru='Счет Фактура RS'");
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры
